-- MySQL dump 10.13  Distrib 5.7.24, for Win64 (x86_64)
--
-- Host: localhost    Database: resheet
-- ------------------------------------------------------
-- Server version	5.7.24-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `teachers`
--

DROP TABLE IF EXISTS `teachers`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `teachers` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `first_name` varchar(50) DEFAULT NULL,
  `last_name` varchar(50) DEFAULT NULL,
  `cellphone` varchar(50) DEFAULT NULL,
  `teacher_type_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `year_id` int(11) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  UNIQUE KEY `user_UNIQUE` (`user_id`,`year_id`),
  KEY `teachers_teacher_type_id` (`teacher_type_id`),
  KEY `teachers_year_id` (`year_id`),
  CONSTRAINT `teachers_teacher_type_id` FOREIGN KEY (`teacher_type_id`) REFERENCES `teacher_types` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `teachers_user_id` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `teachers_year_id` FOREIGN KEY (`year_id`) REFERENCES `years` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=96 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `teachers`
--

LOCK TABLES `teachers` WRITE;
/*!40000 ALTER TABLE `teachers` DISABLE KEYS */;
INSERT INTO `teachers` VALUES (1,'עידן','דוד','054-5555555',1,1,1),(2,'אפרת','שבח','054-3088207',2,2,1),(3,'נעה','וינגרטן','052-4585608',2,3,1),(4,'ענבר','בן ישי','050-8722792',2,4,1),(5,'אביבה','קרפל','054-2018834',2,5,1),(6,'דבי','מילר','054-6236520',2,6,1),(7,'ורד','סבו','אין',2,7,1),(8,'טרייסי','רפאלי','058-4388570',2,8,1),(9,'עדי','מנחם','054-3332030',2,9,1),(10,'רונית','פרץ','050-2442274',2,10,1),(11,'תהלה','סלברמן','052-7040029',2,11,1),(12,'ברק','שבות','058-7657363',2,12,1),(13,'סתוית','דותן','050-6867788',2,13,1),(14,'שולמית','לקס','054-6709586',2,14,1),(15,'שי','רבינוביץ\'','052-7710663',2,15,1),(16,'אודליה','תוהמי','053-7220330',3,16,1),(17,'אורית','מלכה','052-8294264',3,17,1),(18,'אושרי','שרעבי','058-4482233',3,18,1),(19,'אושרת','הרכבי','052-4631318',3,19,1),(20,'אסתי','ספקטור','052-8902621',3,20,1),(21,'גנית','רבני','052-8848863',3,21,1),(22,'דן','פוטש','050-4177756',3,22,1),(23,'הדרה','לויכטר','054-7953720',3,23,1),(24,'הילה','מרציאנו','050-7178871',3,24,1),(25,'טובי','רבינוביץ\'','052-7710664',3,25,1),(26,'ירון','שוקרון','052-8235679',3,26,1),(27,'לאה','ריז\'ק','050-8865200',3,27,1),(28,'מירב','הורביץ','052-4235333',3,28,1),(29,'נתנאל','וידר','052-6318938',3,29,1),(30,'עינת','סמואל','052-8903543',3,30,1),(31,'ענבל','פוגל','052-3263870',3,31,1),(32,'פנינה','בירנבאום','052-5899981',3,32,1),(33,'צופיה','סיאני','050-2050377',3,33,1),(34,'קלרה','דוכן','054-5665536',3,34,1),(35,'רחלי','שרון','054-7652385',3,35,1),(36,'תהילה','נבו','053-3121017',3,36,1),(37,'אפרת','אלמה','054-7516621',2,37,1),(38,'גלית','איפרגן','054-4934527',2,38,1),(39,'הדס','היימן','052-8221131',2,39,1),(40,'נטע','נאמן','052-5844432',2,40,1),(41,'רבקה','דביר','050-7485145',2,41,1),(42,'שמרית','אוריאל','052-4683518',2,42,1),(43,'תמר','ביבי','050-3346644',2,43,1),(44,'מירי','לביא','050-5654515',4,44,1),(45,'יונית','שפירא','054-5676257',2,45,1),(46,'מרב','כהן','052-6717250',2,46,1),(47,'מרינה','שיינין','050-6780482',2,47,1),(48,'רוויה','לוי','052-3323034',2,48,1),(49,'אודהליה','ברלין','052-7076515',2,49,1),(50,'ירון','סאפר','052-8743159',2,50,1),(51,'אורן','דיין','050-9013320',5,51,1),(52,'ברוך','פרקש','050-9309562',5,52,1),(53,'נחמיה','רבי','054-4409022',5,53,1),(54,'נתנאל','שטראוס','052-8109183',5,54,1),(55,'אודליה','גרומבק','054-8327980',6,55,1),(56,'איילת','שטרן','052-4560689',6,56,1),(57,'בת ציון','גולדשמידט','050-4945636',6,57,1),(58,'גלית','קרת','052-6071544',6,58,1),(59,'זהר','מרום','052-4721697',6,59,1),(60,'טליה','בר לב','050-8752400',6,60,1),(61,'מוריה','בירן','052-5665059',6,61,1),(62,'מיכל','עיני','052-6530563',6,62,1),(63,'נעמה','זינגר','052-7902023',6,63,1),(64,'נעמה','עמית','052-6613616',6,64,1),(65,'רות','ביג\'ל','050-2366122',6,65,1),(66,'רעות','לויתן','054-4685584',6,66,1),(67,'רעות','מליחי','053-5274714',6,67,1),(68,'רעות','נאומבורג','054-6255955',6,68,1),(69,'שרה','הרשקוביץ','052-4300383',6,69,1),(70,'תהילה','ברנשטיין','054-3356108',6,70,1),(71,'תם','זמיר','052-3990031',6,71,1),(72,'יפעת','יגל','052-6689535',7,72,1),(73,'אפרת','גרטלר','052-6689537',8,73,1),(74,'ציבי','קורן','052-8726280',8,74,1),(75,'יובל','כהן','054-6887000',2,75,1),(76,'קמי','ויצמן','052-8217920',2,76,1),(77,'רבקה','וולף','054-5711775',2,77,1),(78,'בילי','אוברמן','052-3121757',9,78,1),(79,'יערה','רענן','054-5282680',9,79,1),(80,'מוריה','אלפסי','053-3349986',9,80,1),(81,'מיטביה','כהן','054-5586738',9,81,1),(82,'סמדר','חברוני','050-6746582',9,82,1),(83,'עדי','אוחין','054-2472552',9,83,1),(84,'תמר','עמר','052-2634616',9,84,1),(85,'תניה','טבריס','052-8886983',9,85,1),(86,'אבישג','לוי','052-2918827',10,86,1),(87,'דורית','רודן','052-8870494',10,87,1),(88,'קרן','לב','054-4248621',10,88,1),(89,'רביד','ושדי','052-3297601',10,89,1),(90,'חגית','פינגרהוט','052-5272765',2,90,1),(91,'יגאל','אנקרי','050-2232397',2,91,1),(92,'ירון','בוסי','054-3470633',2,92,1),(93,'מיכאל','אביאל','053-7233878',2,93,1),(94,'שלמה','שלזינגר','054-2574044',2,94,1),(95,'תימורה','דנציגר','050-3016333',11,95,1);
/*!40000 ALTER TABLE `teachers` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-06-30 20:23:10
