-- MySQL dump 10.13  Distrib 5.7.24, for Win64 (x86_64)
--
-- Host: localhost    Database: resheet
-- ------------------------------------------------------
-- Server version	5.7.24-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `students`
--

DROP TABLE IF EXISTS `students`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `students` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `first_name` varchar(20) NOT NULL,
  `last_name` varchar(20) NOT NULL,
  `mother_id` int(11) DEFAULT NULL,
  `father_id` int(11) DEFAULT NULL,
  `class_id` int(11) NOT NULL,
  `year_id` int(11) NOT NULL,
  `picture_path` varchar(1000) DEFAULT NULL,
  `home_phone` varchar(50) DEFAULT '',
  `settlement` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  KEY `students_mother_id` (`mother_id`),
  KEY `students_father_id` (`father_id`),
  KEY `students_class_id` (`class_id`),
  KEY `students_cyear_id` (`year_id`),
  CONSTRAINT `students_class_id` FOREIGN KEY (`class_id`) REFERENCES `classes` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `students_cyear_id` FOREIGN KEY (`year_id`) REFERENCES `years` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `students_father_id` FOREIGN KEY (`father_id`) REFERENCES `parents` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `students_mother_id` FOREIGN KEY (`mother_id`) REFERENCES `parents` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=688 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `students`
--

LOCK TABLES `students` WRITE;
/*!40000 ALTER TABLE `students` DISABLE KEYS */;
INSERT INTO `students` VALUES (629,'פליאה אורה','אביעזר',1211,1212,1,1,'','29938422','כפר עציון'),(630,'טליה','אבן חיים',1213,1214,1,1,'','29936478','מגדל עוז'),(631,'ישי אריה','אופק',1215,1216,1,1,'','29931044','אלעזר'),(632,'תאיר','אדלר',1217,1218,1,1,'','9974055','אפרת'),(633,'אוריה','איגליצקי',1219,1220,1,1,'','5371141','כפר עציון'),(634,'נטיב רז','אל גד',1221,1222,1,1,'','-','שדה בועז'),(635,'נחוניה','בן דור',1223,1224,1,1,'','5797740','כרמי צור'),(636,'נעמי אור','גרינברג',1225,1226,1,1,'','-','כפר עציון'),(637,'יונתן','דאום',1227,1228,1,1,'','9309469','אלעזר'),(638,'תמה','הרשושנים',1229,1230,1,1,'','5804910','פני קדם'),(639,'נועם בתיה','וולף',1231,1232,1,1,'','073-7411790','כפר עציון'),(640,'נעה שולמית','וינשטוק',1233,1234,1,1,'','9938044','פני קדם'),(641,'עברי','ויסמן',1235,1236,1,1,'','9914272','ראש צורים'),(642,'קוה יעקב','טבול',1237,1238,1,1,'','9309101','ראש צורים'),(643,'כרם אהבה','טל',1239,1240,1,1,'','9911883','בת עין'),(644,'טל חיים','כהן',1241,1242,1,1,'','9309372','ראש צורים'),(645,'צור ישראל','כהן',1243,1244,1,1,'','9309176','פני קדם'),(646,'דביר משה ','נוי',1245,1246,1,1,'','9932312','אלעזר'),(647,'אוריה','נחמני',1247,1248,1,1,'','9938763','איבי הנחל'),(648,'עברי','סוננבליק',1249,1250,1,1,'','9934652','אלעזר'),(649,'קמה','עמר',1251,1252,1,1,'','5606375','כפר עציון'),(650,'ירדן','ענבי',1253,1254,1,1,'','-','אלעזר'),(651,'רוני','פרל',1255,1256,1,1,'','5713411','שדה בועז'),(652,'שקד','פרקל',1257,1258,1,1,'','5337248','אלעזר'),(653,'ניר חיים','צחור',1259,1260,1,1,'','-','מגדל עוז'),(654,'כרמי','רבינוביץ',1261,1262,1,1,'','9309869','ראש צורים'),(655,'צופיה רחל','רוזנבלוט',1263,1264,1,1,'','-','ראש צורים'),(656,'איתי אליהו','רותם',1265,1266,1,1,'','9934240','אלעזר'),(657,'שיר','שבות',1267,1268,1,1,'','9934261','ראש צורים'),(658,'יאיר','אבייב ',1269,1270,2,1,'','9962743','עתניאל'),(659,'כלילא ','אביעזר',1271,1272,2,1,'','9938422','כפר עציון'),(660,'אביתר','אוחיון',1273,1274,2,1,'','9933179','הר גילה'),(661,'יונתן','אילי',1275,1276,2,1,'','072-2820239','נווה דניאל'),(662,'נוה','ביים',1277,1278,2,1,'','-','איבי הנחל'),(663,'יותם ','בינג',1279,1280,2,1,'','-','כפר עציון'),(664,'מעיין','ברוך',1281,1282,2,1,'','-','אלון שבות'),(665,'נריה ','גאלדור',1283,1284,2,1,'','5799897','איבי הנחל'),(666,'אלונה ','היימן',1285,1286,2,1,'','6510640','אלעזר'),(667,'שקד','הרמן',1287,1288,2,1,'','-','אלעזר'),(668,'איתם צבי','הרשקוביץ',1289,1290,2,1,'','-','גבעות'),(669,'עמיאל ','זלוטניק',1291,1292,2,1,'','9934950','נווה דניאל'),(670,'שיר אודי','זלמנוביץ',1293,1294,2,1,'','6644308','אלעזר'),(671,'עינה אסתר','טבול',1295,1296,2,1,'','9938233','ראש צורים'),(672,'אלישבע','כהן ',1297,1298,2,1,'','5611104','נווה דניאל'),(673,'יצהר ','לוריא',1299,1300,2,1,'','9309076','פני קדם'),(674,'ברקת','לבמור',1301,1302,2,1,'','6508865','אלעזר'),(675,'תהל','מאיר',1303,1304,2,1,'','077-4553221','אלון שבות'),(676,'אסף ','מבורך',1305,1306,2,1,'','-','אלון שבות'),(677,'יוסף חיים','מקסימוף',1307,1308,2,1,'','02-6639019','ביתר'),(678,'נעם','נאומבורג',1309,1310,2,1,'','-','גבעות'),(679,'אבינעם','נחמני',1311,1312,2,1,'','9938763','איבי הנחל'),(680,'הדר','פוגל',1313,1314,2,1,'','9309803','אלעזר'),(681,'יצחק','קולברון ',1315,1316,2,1,'','9932575','נווה דניאל'),(682,'הודיה','קרימולובסקי',1317,1318,2,1,'','9938130','אלון שבות'),(683,'יערה','קרמר',1319,1320,2,1,'','9933573','ראש צורים'),(684,'אוראל','רוזנראוך',1321,1322,2,1,'','','אלעזר'),(685,'נווה','רבי ',1323,1324,2,1,'','-','כפר עציון'),(686,'מיה','שוימר',1325,1326,2,1,'','9934622','ראש צורים'),(687,'מעיין','שינברג',1327,1328,2,1,'','6487160','כפר עציון');
/*!40000 ALTER TABLE `students` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-05-09 22:17:21
