-- MySQL dump 10.13  Distrib 5.7.24, for Win64 (x86_64)
--
-- Host: localhost    Database: resheet
-- ------------------------------------------------------
-- Server version	5.7.24-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `teachers`
--

DROP TABLE IF EXISTS `teachers`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `teachers` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `first_name` varchar(50) DEFAULT NULL,
  `last_name` varchar(50) DEFAULT NULL,
  `cellphone` varchar(50) DEFAULT NULL,
  `teacher_type_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `year_id` int(11) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  KEY `teachers_teacher_type_id` (`teacher_type_id`),
  KEY `teachers_user_id` (`user_id`),
  KEY `teachers_year_id` (`year_id`),
  CONSTRAINT `teachers_teacher_type_id` FOREIGN KEY (`teacher_type_id`) REFERENCES `teacher_types` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `teachers_user_id` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `teachers_year_id` FOREIGN KEY (`year_id`) REFERENCES `years` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=464 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `teachers`
--

LOCK TABLES `teachers` WRITE;
/*!40000 ALTER TABLE `teachers` DISABLE KEYS */;
INSERT INTO `teachers` VALUES (1,'עידן1','דוד',NULL,12,2,1),(2,'משה','פרץ',NULL,5,2,1),(276,'אפרת ','שבח','054-3088207',47,249,1),(277,'נעה ','וינגרטן','052-4585608',47,250,1),(278,'ענבר','בן ישי','050-8722792',47,251,1),(279,'אביבה','קרפל','054-2018834',47,252,1),(280,'דבי','מילר','054-6236520',47,253,1),(281,'ורד','סבו','אין',47,254,1),(282,'טרייסי ','רפאלי','058-4388570',47,255,1),(283,'עדי','מנחם','054-3332030',47,256,1),(284,'רונית','פרץ',' 050-2442274',47,257,1),(285,'תהלה ','סלברמן','052-7040029',47,258,1),(286,'ברק','שבות','058-7657363',47,259,1),(287,'סתוית ','דותן','050-6867788',47,260,1),(288,'שולמית','לקס','054-6709586',47,261,1),(289,'שי','רבינוביץ\'','052-7710663',47,262,1),(290,'אודליה','תוהמי','053-7220330 ',48,263,1),(291,'אורית','מלכה','052-8294264',48,264,1),(292,'אושרי','שרעבי','058-4482233',48,265,1),(293,'אושרת','הרכבי','052-4631318',48,266,1),(294,'אסתי','ספקטור','052-8902621',48,267,1),(295,'גנית','רבני','052-8848863',48,268,1),(296,'דן','פוטש','050-4177756',48,269,1),(297,'הדרה','לויכטר','054-7953720',48,270,1),(298,'הילה','מרציאנו','050-7178871',48,271,1),(299,'טובי','רבינוביץ\'','052-7710664',48,272,1),(300,'ירון','שוקרון','052-8235679',48,273,1),(301,'לאה','ריז\'ק','050-8865200',48,274,1),(302,'מירב','הורביץ','052-4235333',48,275,1),(303,'נתנאל','וידר','052-6318938',48,276,1),(304,'עינת','סמואל ','052-8903543',48,277,1),(305,'ענבל','פוגל','052-3263870',48,278,1),(306,'פנינה','בירנבאום ','052-5899981',48,279,1),(307,'צופיה','סיאני','050-2050377',48,280,1),(308,'קלרה','דוכן','054-5665536',48,281,1),(309,'רחלי','שרון','054-7652385',48,282,1),(310,'תהילה','נבו','053-3121017',48,283,1),(311,'אפרת','אלמה','054-7516621',47,284,1),(312,'גלית','איפרגן','054-4934527',47,285,1),(313,'הדס','היימן','052-8221131',47,286,1),(314,'נטע','נאמן','052-5844432',47,287,1),(315,'רבקה','דביר','050-7485145',47,288,1),(316,'שמרית','אוריאל','052-4683518',47,289,1),(317,'תמר ','ביבי','050-3346644',47,290,1),(318,'מירי ','לביא','050-5654515',49,291,1),(319,'יונית','שפירא','054-5676257',47,292,1),(320,'מרב','כהן','052-6717250',47,293,1),(321,'מרינה','שיינין','050-6780482',47,294,1),(322,'רוויה','לוי','052-3323034',47,295,1),(323,'אודהליה','ברלין','052-7076515',47,296,1),(324,'ירון','סאפר','052-8743159',47,297,1),(325,'אורן ','דיין','050-9013320',2,298,1),(326,'ברוך','פרקש','050-9309562',2,299,1),(327,'נחמיה','רבי','054-4409022',2,300,1),(328,'נתנאל ','שטראוס','052-8109183',2,301,1),(329,'אודליה','גרומבק','054-8327980',51,302,1),(330,'איילת','שטרן','052-4560689',51,303,1),(331,'בת ציון','גולדשמידט','050-4945636',51,304,1),(332,'גלית ','קרת','052-6071544',51,305,1),(333,'זהר','מרום','052-4721697',51,306,1),(334,'טליה','בר לב','050-8752400',51,307,1),(335,'מוריה','בירן','052-5665059',51,308,1),(336,'מיכל','עיני','052-6530563',51,309,1),(337,'נעמה','זינגר','052-7902023',51,310,1),(338,'נעמה','עמית','052-6613616',51,311,1),(339,'רות','ביג\'ל ','050-2366122',51,312,1),(340,'רעות','לויתן','054-4685584',51,313,1),(341,'רעות','מליחי','053-5274714',51,314,1),(342,'רעות','נאומבורג','054-6255955',51,315,1),(343,'שרה','הרשקוביץ','052-4300383',51,316,1),(344,'תהילה','ברנשטיין','054-3356108',51,317,1),(345,'תם','זמיר','052-3990031',51,318,1),(346,'יפעת','יגל','052-6689535',52,319,1),(347,'אפרת','גרטלר','052-6689537',53,320,1),(348,'ציבי','קורן','052-8726280',53,321,1),(349,'יובל','כהן','054-6887000',47,322,1),(350,'קמי','ויצמן','052-8217920',47,323,1),(351,'רבקה','וולף','054-5711775',47,324,1),(352,'בילי','אוברמן','052-3121757',54,325,1),(353,'יערה','רענן','054-5282680',54,326,1),(354,'מוריה','אלפסי','053-3349986',54,327,1),(355,'מיטביה','כהן','054-5586738',54,328,1),(356,'סמדר','חברוני','050-6746582',54,329,1),(357,'עדי','אוחין','054-2472552',54,330,1),(358,'תמר','עמר','052-2634616',54,331,1),(359,'תניה','טבריס','052-8886983',54,332,1),(360,'אבישג ','לוי','052-2918827',55,333,1),(361,'דורית','רודן','052-8870494',55,334,1),(362,'קרן','לב','054-4248621',55,335,1),(363,'רביד','ושדי','052-3297601',55,336,1),(364,'חגית ','פינגרהוט','052-5272765',47,337,1),(365,'יגאל','אנקרי','050-2232397',47,338,1),(366,'ירון','בוסי','054-3470633',47,339,1),(367,'מיכאל','אביאל','053-7233878',47,340,1),(368,'שלמה','שלזינגר','054-2574044',47,341,1),(369,'תימורה','דנציגר ','050-3016333',56,342,1),(370,'אפרת ','שבח','054-3088207',47,343,1),(371,'נעה ','וינגרטן','052-4585608',47,344,1),(372,'ענבר','בן ישי','050-8722792',47,345,1),(373,'אביבה','קרפל','054-2018834',47,346,1),(374,'דבי','מילר','054-6236520',47,347,1),(375,'ורד','סבו','אין',47,348,1),(376,'טרייסי ','רפאלי','058-4388570',47,349,1),(377,'עדי','מנחם','054-3332030',47,350,1),(378,'רונית','פרץ',' 050-2442274',47,351,1),(379,'תהלה ','סלברמן','052-7040029',47,352,1),(380,'ברק','שבות','058-7657363',47,353,1),(381,'סתוית ','דותן','050-6867788',47,354,1),(382,'שולמית','לקס','054-6709586',47,355,1),(383,'שי','רבינוביץ\'','052-7710663',47,356,1),(384,'אודליה','תוהמי','053-7220330 ',48,357,1),(385,'אורית','מלכה','052-8294264',48,358,1),(386,'אושרי','שרעבי','058-4482233',48,359,1),(387,'אושרת','הרכבי','052-4631318',48,360,1),(388,'אסתי','ספקטור','052-8902621',48,361,1),(389,'גנית','רבני','052-8848863',48,362,1),(390,'דן','פוטש','050-4177756',48,363,1),(391,'הדרה','לויכטר','054-7953720',48,364,1),(392,'הילה','מרציאנו','050-7178871',48,365,1),(393,'טובי','רבינוביץ\'','052-7710664',48,366,1),(394,'ירון','שוקרון','052-8235679',48,367,1),(395,'לאה','ריז\'ק','050-8865200',48,368,1),(396,'מירב','הורביץ','052-4235333',48,369,1),(397,'נתנאל','וידר','052-6318938',48,370,1),(398,'עינת','סמואל ','052-8903543',48,371,1),(399,'ענבל','פוגל','052-3263870',48,372,1),(400,'פנינה','בירנבאום ','052-5899981',48,373,1),(401,'צופיה','סיאני','050-2050377',48,374,1),(402,'קלרה','דוכן','054-5665536',48,375,1),(403,'רחלי','שרון','054-7652385',48,376,1),(404,'תהילה','נבו','053-3121017',48,377,1),(405,'אפרת','אלמה','054-7516621',47,378,1),(406,'גלית','איפרגן','054-4934527',47,379,1),(407,'הדס','היימן','052-8221131',47,380,1),(408,'נטע','נאמן','052-5844432',47,381,1),(409,'רבקה','דביר','050-7485145',47,382,1),(410,'שמרית','אוריאל','052-4683518',47,383,1),(411,'תמר ','ביבי','050-3346644',47,384,1),(412,'מירי ','לביא','050-5654515',49,385,1),(413,'יונית','שפירא','054-5676257',47,386,1),(414,'מרב','כהן','052-6717250',47,387,1),(415,'מרינה','שיינין','050-6780482',47,388,1),(416,'רוויה','לוי','052-3323034',47,389,1),(417,'אודהליה','ברלין','052-7076515',47,390,1),(418,'ירון','סאפר','052-8743159',47,391,1),(419,'אורן ','דיין','050-9013320',2,392,1),(420,'ברוך','פרקש','050-9309562',2,393,1),(421,'נחמיה','רבי','054-4409022',2,394,1),(422,'נתנאל ','שטראוס','052-8109183',2,395,1),(423,'אודליה','גרומבק','054-8327980',51,396,1),(424,'איילת','שטרן','052-4560689',51,397,1),(425,'בת ציון','גולדשמידט','050-4945636',51,398,1),(426,'גלית ','קרת','052-6071544',51,399,1),(427,'זהר','מרום','052-4721697',51,400,1),(428,'טליה','בר לב','050-8752400',51,401,1),(429,'מוריה','בירן','052-5665059',51,402,1),(430,'מיכל','עיני','052-6530563',51,403,1),(431,'נעמה','זינגר','052-7902023',51,404,1),(432,'נעמה','עמית','052-6613616',51,405,1),(433,'רות','ביג\'ל ','050-2366122',51,406,1),(434,'רעות','לויתן','054-4685584',51,407,1),(435,'רעות','מליחי','053-5274714',51,408,1),(436,'רעות','נאומבורג','054-6255955',51,409,1),(437,'שרה','הרשקוביץ','052-4300383',51,410,1),(438,'תהילה','ברנשטיין','054-3356108',51,411,1),(439,'תם','זמיר','052-3990031',51,412,1),(440,'יפעת','יגל','052-6689535',52,413,1),(441,'אפרת','גרטלר','052-6689537',53,414,1),(442,'ציבי','קורן','052-8726280',53,415,1),(443,'יובל','כהן','054-6887000',47,416,1),(444,'קמי','ויצמן','052-8217920',47,417,1),(445,'רבקה','וולף','054-5711775',47,418,1),(446,'בילי','אוברמן','052-3121757',54,419,1),(447,'יערה','רענן','054-5282680',54,420,1),(448,'מוריה','אלפסי','053-3349986',54,421,1),(449,'מיטביה','כהן','054-5586738',54,422,1),(450,'סמדר','חברוני','050-6746582',54,423,1),(451,'עדי','אוחין','054-2472552',54,424,1),(452,'תמר','עמר','052-2634616',54,425,1),(453,'תניה','טבריס','052-8886983',54,426,1),(454,'אבישג ','לוי','052-2918827',55,427,1),(455,'דורית','רודן','052-8870494',55,428,1),(456,'קרן','לב','054-4248621',55,429,1),(457,'רביד','ושדי','052-3297601',55,430,1),(458,'חגית ','פינגרהוט','052-5272765',47,431,1),(459,'יגאל','אנקרי','050-2232397',47,432,1),(460,'ירון','בוסי','054-3470633',47,433,1),(461,'מיכאל','אביאל','053-7233878',47,434,1),(462,'שלמה','שלזינגר','054-2574044',47,435,1),(463,'תימורה','דנציגר ','050-3016333',56,436,1);
/*!40000 ALTER TABLE `teachers` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-05-09 22:17:23
